#Побудувати алгоритм для визначення кількості цифр, що менші за середнє
#арифметичне цифр цього числа.
n = int(input("Введіть значення n = "))
#S - сума чисел
S = 0
i = 1
count = 0
#Додатковий елемент
dele = n
while n>0:
    S+=n%10
    Ser_aref = S/i
    i+=1
    n=n//10
print("Середнє арифметичне:{0}".format(Ser_aref))
while dele>0:
    c=dele%10
    if c<Ser_aref:
        count+=1
        print("Цифра {0} менша за середнє арифметичне".format(c))
    dele=dele//10
print("Кількість цифр менших за  середнє арифметичне:{0}".format(count))







